app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Paradise Lost"], ["text", "a long road and hard"], ["user_id", 2], ["created_at", "2015-04-05 01:12:54.693654"], ["updated_at", "2015-04-05 01:12:54.693654"]]
---
	def create
		@article = current_user.articles.new(article_params)
		if @article.save