app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Virgil"], ["body", "i think my poetry is better"], ["article_id", 1], ["created_at", "2015-04-04 19:08:09.323087"], ["updated_at", "2015-04-04 19:08:09.323087"]]
---
	def create
		@article = Article.find(params[:article_id])
		@article.comments.create(comment_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
	def destroy
		@article = Article.find(params[:article_id])
		@comment = Comment.find(params[:id])
		@comment.destroy