app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "steve"], ["email", "steve@mail.com"], ["created_at", "2015-04-05 17:34:10.998729"], ["updated_at", "2015-04-05 17:34:10.998729"]]